## E23 - Movielens 영화 SBR
Movielens 1M Dataset 이용하여 Session based Recommendation 시스템 제작  
wget http://files.grouplens.org/datasets/movielens/ml-1m.zip  
mv ml-1m.zip ~/aiffel/yoochoose-data  
cd ~/aiffel/yoochoose-data && unzip ml-1m.zip

In [1]:
import datetime as dt
from pathlib import Path
import os

import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
data_path = Path(os.getenv('HOME')+'/aiffel/yoochoose-data/ml-1m') 
train_path = data_path / 'ratings.dat'

def load_data(data_path: Path, nrows=None):
    data = pd.read_csv(data_path, sep='::', header=None, usecols=[0, 1, 2, 3], dtype={0: np.int32, 1: np.int32, 2: np.int32}, nrows=nrows)
    data.columns = ['UserId', 'ItemId', 'Rating', 'Time']
    return data

data = load_data(train_path, None)
data.sort_values(['UserId', 'Time'], inplace=True)  # data를 id와 시간 순서로 정렬해줍니다.
data

         UserId  ItemId  Rating       Time
31            1    3186       4  978300019
22            1    1270       5  978300055
27            1    1721       4  978300055
37            1    1022       5  978300055
24            1    2340       3  978300103
...         ...     ...     ...        ...
1000019    6040    2917       4  997454429
999988     6040    1921       4  997454464
1000172    6040    1784       3  997454464
1000167    6040     161       3  997454486
1000042    6040    1221       4  998315055

[1000209 rows x 4 columns]

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000209 entries, 31 to 1000042
Data columns (total 4 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   UserId  1000209 non-null  int32
 1   ItemId  1000209 non-null  int32
 2   Rating  1000209 non-null  int32
 3   Time    1000209 non-null  int64
dtypes: int32(3), int64(1)
memory usage: 26.7 MB

In [5]:
# Time컬럼을 datetime형으로 바꾸기

data['Time'] = pd.to_datetime(data['Time'], unit='s')
data

         UserId  ItemId  Rating                Time
31            1    3186       4 2000-12-31 22:00:19
22            1    1270       5 2000-12-31 22:00:55
27            1    1721       4 2000-12-31 22:00:55
37            1    1022       5 2000-12-31 22:00:55
24            1    2340       3 2000-12-31 22:01:43
...         ...     ...     ...                 ...
1000019    6040    2917       4 2001-08-10 14:40:29
999988     6040    1921       4 2001-08-10 14:41:04
1000172    6040    1784       3 2001-08-10 14:41:04
1000167    6040     161       3 2001-08-10 14:41:26
1000042    6040    1221       4 2001-08-20 13:44:15

[1000209 rows x 4 columns]

### Step 1. 데이터의 전처리

In [6]:
data['UserId'].nunique(), data['ItemId'].nunique()

(6040, 3706)

In [7]:
UserId_length = data.groupby('UserId').size()
UserId_length

UserId
1        53
2       129
3        51
4        21
5       198
       ...
6036    888
6037    202
6038     20
6039    123
6040    341
Length: 6040, dtype: int64

In [8]:
UserId_length.median(), UserId_length.mean()

(96.0, 165.5975165562914)

In [9]:
UserId_length.min(), UserId_length.max()

(20, 2314)

In [10]:
UserId_length.quantile(0.999)

1343.181000000005

In [11]:
long_UserId = UserId_length[UserId_length==2314].index[0]
data[data['UserId']==long_UserId]

        UserId  ItemId  Rating                Time
696969    4169    1268       5 2000-08-03 20:09:52
697168    4169    2617       4 2000-08-03 20:09:52
697185    4169    2628       4 2000-08-03 20:09:52
697219    4169    2653       4 2000-08-03 20:09:52
697275    4169     423       3 2000-08-03 20:09:52
...        ...     ...     ...                 ...
697882    4169    3754       2 2002-06-15 20:52:27
695702    4169    1413       3 2002-06-15 21:03:51
697358    4169     494       4 2002-06-15 21:16:00
695945    4169    1804       2 2002-06-15 21:16:23
696446    4169    1548       3 2002-06-15 21:25:37

[2314 rows x 4 columns]